Write a solution to show the unique ID of each user, If a user does not have a unique ID replace just show null.

Return the result table in any order.

In [2]:
import pandas as pd
import numpy as np

In [3]:
data = [[1, 'Alice'], [7, 'Bob'], [11, 'Meir'], [90, 'Winston'], [3, 'Jonathan']]

employees = pd.DataFrame(data, columns=['id', 'name']).astype({'id':'int64', 'name':'object'})

data = [[3, 1], [11, 2], [90, 3]]

employee_uni = pd.DataFrame(data, columns=['id', 'unique_id']).astype({'id':'int64', 'unique_id':'int64'})

In [4]:
employees

   id      name
0   1     Alice
1   7       Bob
2  11      Meir
3  90   Winston
4   3  Jonathan

In [5]:
employee_uni

   id  unique_id
0   3          1
1  11          2
2  90          3

In [6]:
def replace_employee_id(employees: pd.DataFrame, employee_uni: pd.DataFrame) -> pd.DataFrame:
    result = employees.merge(employee_uni, on = 'id', how= 'left')
    return result[['unique_id', 'name']]

In [7]:
replace_employee_id(employees, employee_uni)

   unique_id      name
0        NaN     Alice
1        NaN       Bob
2        2.0      Meir
3        3.0   Winston
4        1.0  Jonathan